package main

import "fmt"

// 在一个由 '0' 和 '1' 组成的二维矩阵内，找到只包含 '1' 的最大正方形，并返回其面积。
//
// 示例 1：
//
// 输入：matrix = [
// ["1","0","1","0","0"],
// ["1","0","1","1","1"],
// ["1","1","1","1","1"],
// ["1","0","0","1","0"]]
// 输出：4
// 示例 2：
//
// 输入：matrix = [["0","1"],["1","0"]]
// 输出：1
// 示例 3：
//
// 输入：matrix = [["0"]]
// 输出：0
func maximalSquare1(matrix [][]byte) int {

}

func main() {
	fmt.Println(maximalSquare1([][]byte{
		{'1', '0', '1', '0', '0'},
		{'1', '0', '1', '1', '1'},
		{'1', '1', '1', '1', '1'},
		{'1', '0', '0', '1', '0'},
	}))
	fmt.Println(maximalSquare1([][]byte{
		{'0', '1'},
		{'1', '0'},
	}))
	fmt.Println(maximalSquare1([][]byte{
		{'1', '1', '1', '1', '0'},
		{'1', '1', '1', '1', '0'},
		{'1', '1', '1', '1', '1'},
		{'1', '1', '1', '1', '1'},
		{'0', '0', '1', '1', '1'},
	}))
}
